[
  {
    "value": "رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ"
  },
  {
    "value": "اللهم إني أعوذ بك من فتنة النار وعذاب النار، وفتنة القبر، وعذاب القبر، وشرفتنة الغنى، وشر فتنة الفقر، اللهم إني أعوذ بك من شر فتنة المسيح الدجال،اللهم اغسل قلبي بماء الثلج والبرد، ونق قلبي من الخطايا كما نقيت الثوبالأبيض من الدنس، وباعد بيني وبين خطاياي كما باعدت بين المشرق والمغرب.اللهم إني أعوذ بك من الكسل والمأثم والمغرم"
  },
  {
    "value": "للهم إني أعوذ بك من العجز والكسل، والجبن والهرم والبخل، وأعوذ بك من عذاب القبر، ومن فتنة المحيا والممات"
  },
  {
    "value": "اللهم إني أعوذ بك من جهد البلاء، ودرك الشقاء، وسوء القضاء، وشماتة الأعداء"
  },
  {
    "value": "اللهم أصلح لي ديني الذي هو عصمة أمري، وأصلح لي دنياي التي فيها معاشي، وأصلحلي آخرتي التي فيها معادي، واجعل الحياة زيادة لي في كل خير، واجعل الموتراحة لي من كل شر"
  },
  {
    "value": "اللهم إني أسألك الهدى، والتقى، والعفاف، والغنى"
  },
  {
    "value": "اللهم إني أعوذ بك من العجز، والكسل، والجبن، والبخل، والهرم، وعذاب القبر،اللهم آت نفسي تقواها، وزكها أنت خير من زكاها. أنت وليها ومولاها. اللهمإني أعوذ بك من علم لا ينفع، ومن قلب لا يخشع، ومن نفس لا تشبع، ومن دعوةلا يستجاب لها"
  },
  {
    "value": "اللهم اهدني وسددني، اللهم إني أسألك الهدى والسداد"
  },
  {
    "value": "اللهم إني أعوذ بك من زوال نعمتك، وتحول عافيتك، وفجاءة نقمتك، وجميع سخطك"
  },
  {
    "value": "اللهم إني أعوذ بك من شر ما عملت، ومن شر ما لم أعمل"
  },
  {
    "value": "اللهم أكثر مالي، وولدي، وبارك لي فيما أعطيتني\" يدل عليه دعاء النبي صلى الله عليه وسلم لأنس \"اللهم أكثر ماله، وولده وبارك له فيما أعطيته\"متفق عليه \"وأصلح حياتي على طاعتك وأحسن عملي واغفر لي"
  },
  {
    "value": "لا إله إلا الله العظيم الحليم، لا إله إلا الله رب العرش العظيم، لا إله إلا الله رب السماوات، ورب الأرض، ورب العرش الكريم"
  },
  {
    "value": "اللهم رحمتك أرجو فلا تكلني إلى نفسي طرفة عين، وأصلح لي شأني كله، لا إله إلا أنت"
  },
  {
    "value": "لاإله إلا أنت سبحانك إني كنت من الظالمين\" رواه الترمذي والحاكم وصححهووافقه الذهبي ولفظه\"دعوة ذي النون إذ دعا وهو في بطن الحوت: لا إله إلاأنت سبحانك إني كنت من الظالمين. فإنه لم يدعُ بها رجل مسلم في شيء قط إلااستجاب الله له"
  },
  {
    "value": "اللهم إني عبدك ابن عبدك، ابن أمتك، ناصيتي بيدك، ماضي فيّ حكمك، عدل في قضاؤك.أسألك بكل اسم هو لك سميت به نفسك، أو أنزلته في كتابك، أو علمته أحداً منخلقك، أو استأثرت به في علم الغيب عندك، أن تجعل القرآن ربيع قلبي، ونورصدري، وجلاء حزني، وذهاب همي"
  },
  {
    "value": "اللهم مصرف القلوب صرف قلوبنا على طاعتك"
  },
  {
    "value": "يامقلب القلوب ثبت قلبي على دينك\"رواه الترمذي وأحمد والحاكم وصححه ووافقهالذهبي. وقد قالت أم سلمة رضي الله عنها \"كان أكثر دعائه صلى الله عليهوسلم"
  },
  {
    "value": "اللهم إني أسألك العافية في الدنيا والآخرة\" رواه الترمذي ولفظه \" سلو اللهالعافية في الدنيا والآخرة\"وفي لفظ: \"سلوا الله العفو والعافية فإن أحداًلم يعط بعد اليقين خيراً من العافية"
  },
  {
    "value": "اللهم أحسن عاقبتنا في الأمور كلها، وأجرنا من خزي الدنيا وعذاب الآخرة"
  },
  {
    "value": "رب أعني ولا تعن علي، وانصرني ولا تنصر علي، وامكر لي ولا تمكر علي، واهدنيويسر الهدى إلي، وانصرني على من بغى علي، رب اجعلني لك شكاراً، لك ذكاراً،لك مطواعاً، إليك مخبتاً أواهاً منيباً، رب تقبل توبتي، واغسل حوبتي، وأجبدعوتي، وثبت حجتي، واهد قلبي، وسدد لساني، واسلل سخيمة قلبي"
  },
  {
    "value": "اللهم إنا نسألك من خير ما سألك منه نبيك محمد صلى الله عليه وسلم، ونعوذ بك منشر ما استعاذ منه نبيك محمد صلى الله عليه وسلم، وأنت المستعان، وعليكالبلاغ، ولا حول ولا قوة إلا بالله"
  },
  {
    "value": "اللهم إني أعوذ بك من شر سمعي، ومن شر بصري، ومن شر لساني، ومن شر قلبي، ومن شر منيي"
  },
  {
    "value": "اللهم إني أعوذ بك من البرص، والجنون، والجذام، ومن سيئ الأسقام"
  },
  {
    "value": "اللهم إني أعوذ بك من منكرات الأخلاق، والأعمال، والأهواء"
  },
  {
    "value": "اللهم إنك عفو كريم تحب العفو فاعف عني"
  },
  {
    "value": "اللهم إني أسألك فعل الخيرات، وترك المنكرات، وحب المساكين، وأن تغفر لي،وترحمني، وإذا أردت فتنة قوم فتوفني غير مفتون، وأسألك حبك، وحب من يحبك،وحب عمل يقربني إلى حبك\" رواه أحمد بلفظه والترمذي بنحوه والحاكم وحسنهالترمذي وقال سألت محمد بن إسماعيل - يعني البخاري - فقال: هذا حديث حسنصحيح. وفي آخر الحديث قال صلى الله عليه وسلم: \"إنها حق فادرسوها وتعلموه"
  },
  {
    "value": "اللهم إني أسألك من الخير كله: عاجله وآجله، ما علمت منه وما لم أعلم، وأعوذ بكمن الشر كله عاجله وآجله، ما علمت منه وما لم أعلم. اللهم إني أسألك من خيرما سألك عبدك ونبيك، وأعوذ بك من شر ما استعاذ بك منه عبدك ونبيك. اللهمإني أسألك الجنة، وما قرب إليها من قول أو عمل، وأعوذ بك من النار وما قربإليها من قول أو عمل، وأسألك أن تجعل كل قضاء قضيته لي خيراً"
  },
  {
    "value": "اللهم احفظني بالإسلام قائماً، واحفظني بالإسلام قاعداً، واحفظني بالإسلامراقداً، ولا تشمت بي عدواً ولا حاسداً. اللهم إني أسألك من كل خير خزائنهبيدك، وأعوذ بك من كل شر خزائنه بيدك"
  },
  {
    "value": "اللهم اقسم لنا من خشيتك ما تحول به بيننا وبين معاصيك، ومن طاعتك ما تبلغنا بهجنتك، ومن اليقين ما تهون به علينا مصائب الدنيا، اللهم متعنا بأسماعنا،وأبصارنا، وقواتنا ما أحييتنا، واجعله الوارث منا، واجعل ثأرنا على منظلمنا، وانصرنا على من عادانا، ولا تجعل مصيبتنا في ديننا، ولا تجعل الدنياأكبر همنا، ولا مبلغ علمنا، ولا تسلط علينا من لا يرحمنا"
  },
  {
    "value": "اللهم إني أعوذ بك من الجبن، وأعوذ بك من البخل، وأعوذ بك من أن أرد إلى أرذل العمر، وأعوذ بك من فتنة الدنيا وعذاب القبر"
  },
  {
    "value": "اللهم اغفر لي خطيئتي، وجهلي، وإسرافي في أمري، وما أنت أعلم به مني، اللهم اغفر لي هزلي وجدي، وخطئي وعمدي، وكل ذلك عندي"
  },
  {
    "value": "اللهم إني ظلمت نفسي ظلماً كثيراً، ولا يغفر الذنوب إلا أنت. فاغفر لي مغفرة من عندك، وارحمني إنك أنت الغفور الرحيم"
  },
  {
    "value": "اللهم لك أسلمت، وبك آمنت، وعليك توكلت، وإليك أنبت وبك خاصمت. اللهم إني أعوذبعزتك لا إله إلا أنت أن تضلني. أنت الحي الذي لا يموت، والجن والإنسيموتون"
  },
  {
    "value": "اللهم إنا نسألك موجبات رحمتك، وعزائم مغفرتك، والسلامة من كل إثم، والغنيمة من كل بر، والفوز بالجنة، والنجاة من النار"
  },
  {
    "value": "اللهم اجعل أوسع رزقك علي عند كبر سني، وانقطاع عمري"
  },
  {
    "value": "اللهم اغفر لي ذنبي، ووسع لي في داري، وبارك لي في رزقي"
  },
  {
    "value": "اللهم إني أسألك من فضلك ورحمتك، فإنه لا يملكها إلا أنت"
  },
  {
    "value": "اللهم إني أعوذ بك من التردي، والهدم، والغرق، والحرق، وأعوذ بك أن يتخبطنيالشيطان عند الموت، وأعوذ بك أن أموت في سبيلك مدبراً، وأعوذ بك أن أموتلديغاً"
  },
  {
    "value": "اللهم إني أعوذ بك من الجوع، فإنه بئس الضجيع، وأعوذ بك من الخيانة، فإنها بئست البطانة\" رواه أبو داود ، والنسائي"
  },
  {
    "value": "اللهم إني أعوذ بك من العجز، والكسل، والجبن، والبخل، والهرم، والقسوة، والغفلة،والعيلة، والذلة، والمسكنة، وأعوذ بك من الفقر، والكفر، والفسوق، والشقاق،والنفاق، والسمعة، والرياء، وأعوذ بك من الصمم، والبكم، والجنون، والجذام،والبرص، وسيئ الأسقام"
  },
  {
    "value": "اللهم إني أعوذ بك من الفقر، والقلة، والذلة، وأعوذ بك من أن أظلم أو أظلم"
  },
  {
    "value": "اللهم إني أعوذ بك من جار السوء في دار المقامة؛ فإن جار البادية يتحول"
  },
  {
    "value": "اللهم إني أعوذ بك من قلب لا يخشع، ومن دعاء لا يسمع، ومن نفس لا تشبع، ومن علم لا ينفع. أعوذ بك من هؤلاء الأربع"
  },
  {
    "value": "اللهم إني أعوذ بك من يوم السوء، ومن ليلة السوء، ومن ساعة السوء، ومن صاحب السوء، ومن جار السوء في دار المقامة"
  },
  {
    "value": "اللهم إني أسألك الجنة وأستجير بك من النار\"(ثلاث مرات) رواه الترمذي وابن ماجهوالنسائي ولفظه\"من سأل الله الجنة ثلاث مرات قالت الجنة: اللهم أدخله الجنةومن استجار من النار ثلاث مرات قالت النار اللهم أجره من النار"
  },
  {
    "value": "\"اللهم فقهني في الدين\" يدل عليه رواية البخاري ومسلم في دعاء النبي صلى الله عليه وسلم لابن عباس رضي الله عنهما"
  },
  {
    "value": "اللهم إني أعوذ بك أن أشرك بك وأنا أعلم، وأستغفرك لما لا أعلم"
  },
  {
    "value": "اللهم انفعني بما علمتني، وعلمني ما ينفعني، وزدني علماً"
  },
  {
    "value": "اللهم إني أسألك علماً نافعاً، ورزقاً طيباً، وعملاً متقبلاً"
  },
  {
    "value": "اللهم إني أسألك يا الله بأنك الواحد الأحد، الصمد الذي لم يلد ولم يولد، ولميكن له كفواً أحد، أن تغفر لي ذنوبي، إنك أنت الغفور الرحيم"
  },
  {
    "value": "اللهم إني أسألك بأن لك الحمد، لا إله إلا أنت, وحدك لا شريك لك, المنان, يابديع السماوات والأرض، يا ذا الجلال والإكرام، يا حي يا قيوم، إني أسألكالجنة وأعوذ بك من النار"
  },
  {
    "value": "اللهم إني أسألك بأني أشهد أنك أنت الله لا إله إلا أنت، الأحد، الصمد، الذي لم يلد، ولم يولد، ولم يكن له كفواً أحد"
  },
  {
    "value": "رب اغفر لي، وتب علي، إنك أنت التواب الغفور"
  },
  {
    "value": "اللهم بعلمك الغيب، وقدرتك على الخلق، أحيني ما علمت الحياة خيراً لي، وتوفنيإذا علمت الوفاة خيراً لي، اللهم إني أسألك خشيتك في الغيب والشهادة،وأسألك كلمة الحق في الرضا والغضب، وأسألك القصد في الغنى والفقر، وأسألكنعيماً لا ينفذ، وأسألك قرة عين لا تنقطع، وأسألك الرضا بعد القضاء، وأسألكبرد العيش بعد الموت، وأسألك لذة النظر إلى وجهك، والشوق إلى لقائك، فيغير ضراء مضرة، ولا فتنة مضلة، اللهم زينا بزينة الإيمان، واجعلنا هداةمهتدين"
  },
  {
    "value": "اللهمارزقني حبك، وحب من ينفعني حبه عندك، اللهم ما رزقتني مما أحب فاجعله قوةلي فيما تحب، اللهم ما زويت عني مما أحب فاجعله فراغاً لي فيما تحب"
  },
  {
    "value": "اللهم طهرني من الذنوب والخطايا، اللهم نقني منها كما ينقى الثوب من الدنس، اللهم طهرني بالثلج والبرد والماء البارد"
  },
  {
    "value": "اللهم إني أعوذ بك من البخل، والجبن، وسوء العمر، وفتنة الصدر، وعذاب القبر"
  },
  {
    "value": "اللهم ألهمني رشدي، وأعذني من شر نفسي"
  },
  {
    "value": "اللهم إني أسألك علماً نافعاً، وأعوذ بك من علم لا ينفع\" رواه ابن ماجه ولفظه \"سلوا الله علماً نافعاً وتعوذوا بالله من علم لا ينفع"
  },
  {
    "value": "اللهمرب السماوات السبع ورب الأرض، ورب العرش العظيم، ربنا ورب كل شيء، فالقالحب والنوى، ومنزل التوراة والإنجيل والفرقان، أعوذ بك من شر كل شيء أنتآخذ بناصيته، اللهم أنت الأول فليس قبلك شيء، وأنت الآخر فليس بعدك شيء،وأنت الظاهر فليس فوقك شيء، وأنت الباطن فليس دونك شيء، اقض عنا الدينوأغننا من الفقر"
  },
  {
    "value": "اللهم ألف بين قلوبنا، وأصلح ذات بيننا، واهدنا سبل السلام، ونجنا من الظلمات إلى النور، وجنبنا الفواحش ما ظهر منها وما بطن، وبارك لنا في أسماعنا، وأبصارنا، وقلوبنا، وأزواجنا، وذرياتنا، وتب علينا إنك أنت التواب الرحيم، واجعلنا شاكرين لنعمتك مثنين بها عليك قابلين لها وأتممها علينا"
  },
  {
    "value": "اللهم إني أسألك خير المسألة، وخير الدعاء، وخير النجاح، وخير العمل، وخير الثواب، وخير الحياة، وخير الممات، وثبتني، وثقل موازيني، وحقق إيماني، وارفع درجاتي، وتقبل صلاتي، واغفر خطيئتي، وأسألك الدرجات العلى من الجنة، اللهم إني أسألك فواتح الخير، وخواتمه، وجوامعه، وأوله، وظاهره، وباطنه، والدرجات العلى من الجنة آمين. اللهم إني أسألك خير ما آتي، وخير ما أفعل، وخير ما أعمل، وخير ما بطن، وخير ما ظهر، والدرجات العلى من الجنة آمين. اللهم إني أسألك أن ترفع ذكري، وتضع وزري، وتصلح أمري، وتطهر قلبي، وتحصن فرجي، وتنور قلبي، وتغفر لي ذنبي، وأسألك الدرجات العلى من الجنة آمين. اللهم إني أسألك أن تبارك في نفسي، وفي سمعي، وفي بصري، وفي روحي، وفي خلقي، وفي خلقي، وفي أهلي، وفي محياي، وفي مماتي، وفي عملي، فتقبل حسناتي، وأسألك الدرجات العلى من الجنة آمين"
  },
  {
    "value": "اللهم جنبني منكرات الأخلاق، والأهواء، والأعمال، والأدواء"
  },
  {
    "value": "اللهم قنعني بما رزقتني، وبارك لي فيه، واخلف عليّ كل غائبة لي بخير"
  },
  {
    "value": "اللهم حاسبني حساباً يسيراً\"رواه أحمد والحاكم وقال صحيح على شرط مسلم ووافقه الذهبي 1/255 قالت عائشة رضي الله عنها: فلما انصرف قلت يا نبي الله ما الحساب اليسير؟ قال: \"أن ينظر في كتابه فيتجاوز عنه إنه من نوقش الحساب يومئذ يا عائشة هلك وكل ما يصيب المؤمن يكفر الله عز وجل به عنه حتى الشوكة تشوكه"
  },
  {
    "value": "اللهم أعنا على ذكرك، وشكرك، وحسن عبادتك"
  },
  {
    "value": "اللهم إني أسألك إيماناً لا يرتد، ونعيماً لا ينفذ، ومرافقة محمد صلى الله عليه وسلم في أعلى جنة الخلد"
  },
  {
    "value": "اللهم قني شر نفسي، واعزم لي على أرشد أمري، اللهم اغفر لي ما أسررت، وما أعلنت، وما أخطأت، وما عمدت، وما علمت، وما جهلت"
  },
  {
    "value": "اللهم إني أعوذ بك من غلبة الدين، وغلبة العدو، وشماتة الأعداء"
  },
  {
    "value": "اللهم اغفر لي، واهدني، وارزقني، وعافني، أعوذ بالله من ضيق المقام يوم القيامة"
  },
  {
    "value": "اللهم متعني بسمعي، وبصري، واجعلهما الوارث مني، وانصرني على من يظلمني، وخذ منه بثأري"
  },
  {
    "value": "اللهم إني أسألك عيشة نقية، وميتة سوية، ومرداً غير مخز ولا فاضح"
  },
  {
    "value": "اللهم لك الحمد كله، اللهم لا قابض لما بسطت، ولا باسط لما قبضت، ولا هادي لمن أضللت ولا مضل لمن هديت، ولا معطي لما منعت ولا مانع لما أعطيت، ولا مقرب لما باعدت، ولا مباعد لما قربت، اللهم ابسط علينا من بركاتك ورحمتك وفضلك ورزقك، اللهم إني أسألك النعيم المقيم الذي لا يحول ولا يزول، اللهم إني أسألك النعيم يوم العيلة، والأمن يوم الخوف، اللهم إني عائذ بك من شر ما أعطيتنا وشر ما منعتنا، اللهم حبب إلينا الإيمان وزينه في قلوبنا وكره إلينا الكفر والفسوق والعصيان واجعلنا من الراشدين، اللهم توفنا مسلمين، وأحينا مسلمين، وألحقنا بالصالحين غير خزايا ولا مفتونين، اللهم قاتل الكفرة الذين يكذبون رسلك ويصدون عن سبيلك، واجعل عليهم رجزك وعذابك، اللهم قاتل الكفرة الذين أوتوا الكتاب؛ إله الحق [آمين]"
  },
  {
    "value": "اللهم اغفر لي، وارحمني، واهدني، وعافني، وارزقني\" رواه مسلم وفي رواية لمسلم\"فإن هؤلاء تجمع لك دنياك وآخرتك\"وفي سنن أبي داود قال: \"فلما ولى الأعرابي قال النبي صلى الله عليه وسلم: \"لقد ملأ يديه من الخير\" \"... واجبرني وارفعني"
  },
  {
    "value": "اللهم زدنا ولا تنقصنا، وأكرمنا ولا تهنا، وأعطنا ولا تحرمنا، وآثرنا ولا تؤثر علينا، وأرضنا وارض عنا"
  },
  {
    "value": "اللهم أحسنت خَلقي فأحسن خُلُقي"
  },
  {
    "value": "اللهم ثبتني واجعلني هادياً مهدياً\" دل عليه دعاء النبي صلى الله عليه وسلم لجرير رضي الله عنه"
  },
  {
    "value": "\"اللهم آتني الحكمة التي من أوتيها فقد أوتي خيراً كثيراً\" قال سبحانه وتعالى: {يُؤتِي الْحِكْمَةَ مَن يَشَاء وَمَن يُؤْتَ الْحِكْمَةَ فَقَدْ أُوتِيَ خَيْرًا كَثِيرًا} البقرة "
  },
  {
    "value": "اللهم اغفر لى خطيئتى وجهلى، واسرافى فى امرى وما انت اعلم به منى : اللهم اغفر لى جدى وهزلى وخطئ وعمدى وكل ذلك عندى , اللهم اغفر لى ما قدمت وما اخرت وما اسررت وما اعلنت وما انت اعلم به منى انت المقدم وانت المؤخر وانت على كل شيىء قدير"
  },
  {
    "value": "اللهم اكفنى بحلالك عن حرامك وأعننى بفضلك عمن سواك"
  },
  {
    "value": "اللهم انى اسئلك حبك وحب من يحبك والعمل الذى يبلغنى حبك : اللهم اجعل حبك احب الى من نفسى واهلى ومن الماء البارد"
  },
  {
    "value": "عن ابن عباس قال : كان النبي صلى الله عليه وسلم إذا قام من الليل يتهجد قال : \" اللهم لك الحمد أنت قيم السماوات والأرض ومن فيهن ولك الحمد أنت نور السماوات والأرض ومن فيهن ولك الحمد أنت ملك السماوات والأرض ومن فيهن ولك الحمد أنت الحق ووعدك الحق ولقاؤك حق وقولك حق والجنة حق والنار حق والنبيون حق ومحمد حق والساعة حق اللهم لك أسلمت وبك آمنت وعليك توكلت وإليك أنبت وبك خاصمت وإليك حاكمت فاغفر لي ما قدمت وما أخرت وما أسررت وما أعلنت وما أنت أعلم به مني أنت المقدم وأنت المؤخر لا إله إلا أنت ولا إله غيرك"
  },
  {
    "value": "عن ابى هريرة ان ابا بكر الصديق ، قال لرسول الله صلى الله عليه وسلم مرنى بشىء اقوله اذا اصبحت واذا امسيت قال قل \"اللهم عالم الغيب والشهادة فاطر السماوات والارض رب كل شىء ومليكه ، أشهد أن لا إله إلا الله أنت أعوذ بك من شر نفسى وشر الشيطان وشركه ، وأن نقترف سوءاً على أنفسنا أو نجره على مسلم \" قله اذا اصحبت واذا امسيت واذا اخذت مضجعك"
  },
  {
    "value": "اللهم قنى عذابك يوم تبعث عبادك"
  },
  {
    "value": "عن ابى هريرة رضى الله عنه قال : قال رسول الله صلى الله عليه وسلم اذا اوى احدكم الى فراشة فلينفض فراشة بداخلة ازاره فانه لا يدرى ما خلفه عليه ثم يقول \" باسمك ربى وضعت جنبى وبك ارفعه ان امسك نفسى فارحمها وان ارسلتها فاحفظها بما تحفظ بها عبادك الصالحين \" "
  },
  {
    "value": "يا حى ياقيوم برحمتك استغيث"
  },
  {
    "value": " اذا وجدت وجع فى جسدك فضع يدك على الذى يتألم من جسدك وقل \" بسم الله (ثلاثا) وقل سبع مرات أعوذ بعزة الله وقدرته من شر ما أجد وأحاذر\" "
  },
  {
    "value": "عن انس رضى الله عنه قال لثابت رحمه الله الا ارقيك برقية رسول الله صلى الله عليه وسلم قال بلى \" قال اللهم رب الناس مذهب البأس اشف أنت الشافى لا شافى الا انت شفاء لا يغادر سقما\" "
  },
  {
    "value": "عن ابن عباس رضى الله عنهما عن النبى صلى الله عليه وسلم قال \" من عاد مريضا لم يحضره اجله فقال عنده سبع مرات اسال الله العظيم رب العرش العظيم ان يشفيك : إلا عافاه الله من ذلك المرض\" "
  },
  {
    "value": "عن ابى سعيد الخدرى رضى الله عنه ان جبريل أتى النبى صلى الله عليه وسلم فقال يا محمد اشتكيت قال نعم قال \"بسم الله أرقيك من كل شىء يؤذيك ومن شر كل نفس اوعين حاسد الله يشفيك بسم الله ارقيك\" "
  },
  {
    "value": "اللهم انى اعوذ بك من شر ماعملت ومن شر مالم اعمل"
  },
  {
    "value": "إذا هم احدكم بالامر فليركع ركعتين من غير الفريضة ثم ليقل \"اللهم انى استخير بعلمك واستقدرك بقدرتك وأسألك من فضلك العظيم ، فانك تقدر ولا اقدر وتعلم ولا اعلم وانت علام الغيوب اللهم ان كنت تعلم أن هذا الامر خير لى فى دينى ومعاشى وعاقبة أمرى,أو قال عاجل امرى وآجله فاقدره لى ويسره لى ثم بارك لى فيه\" "
  },
  {
    "value": "عن ام سلمة قالت سمعت رسول الله صلى الله عليه وسلم يقول ما من عبد تصبيه مصيبة فيقول \" إنا لله وانا اليه راجعون : اللهم آجرنى فى مصيبتى واخلف لى خيرا منها إلا آجره الله تعالى فى مصيبته واخلف له خيرا منها\" "
  },
  {
    "value": "عن ابى عبد الرحمن عوف بن مالك رضى الله عنه :صلى رسول الله صلى الله عليه وسلم على جنازة فحفظت من دعائه وهو يقول :\"اللهم اغفر له وارحمه وعافه واعف عنه واكرم نزله ووسع مدخله واغسله بالماء والثلج والبرد ونقه من الخطايا كما نقيت الثوب الابيض من الدنس وابدله دارا خيرا من داره واهلا خيرا من اهله وزوجا خيرا من زوجه وادخله الجنة اعذه من عذاب القبر ومن عذاب النار حتى تمنيت ان اكون انا ذلك الميت \""
  },
  {
    "value": "عن ابى هريرة وابى قتادة وابى ابراهيم الاشهيلى عن ابيه وابوه صحابى رضى الله عنهم عن النبى صلى الله عيه وسلم انه صلى على جنازة فقال \"اللهم اغفر لحينا وميتنا وصغيرنا وكبيرنا وذكرنا وانثانا وشاهدنا وغائبنا :اللهم من احييته منا فاحيه على الاسلام ومن توفيته منا فتوفه على الايمان اللهم لا تحرمنا اجره والاتفتنا بعده\" \n"
  },
  {
    "value": "عن ابى هريرة رضى الله عنه عن النبى صلى الله عليه وسلم فى الصلاة على الجنازة \"اللهم انت ربها وأنت خلقتها وأنت هديتها للاسلام وانت قبضت روحها وأنت اعلم بسرها وعلانيتها وقد جئناك شفعاء لها فاغفر لها\" "
  },
  {
    "value": "عن ابى موسى الاشعرى رضى الله عنه ان رسول الله صلى الله عليه وسلم كان اذا خاف قوما قال \" اللهم إنا نجعلك فى نحورهم ونعوذ بك من شرورهم\" "
  },
  {
    "value": "روى ان خالد بن الوليد شكا الى رسول الله صلى الله عليه وسلم الأ رق فقالالنبى صلى الله عليه وسلم إذا أويت الى فراشك فقل \"اللهم رب السموات السبعوما أظلت ورب الأرضين وما أقلت ورب الشياطين وما أضلت كن لى جارا من شرخلقك كلهم جميعا ، أن يفرط على احد منهم او ان يبغى على ،عز جارك وجل ثناؤكولا إله غيرك لاإله إلا انت"
  },
  {
    "value": "اللهم اجعل في قلبي نورا وفي بصري نورا وفي سمعي نورا وعن يميني نورا وعن يسارينورا وفوقي نورا وتحتي نورا وأمامي نورا وخلفي نورا واجعل لي نورا \" وزادبعضهم : \" وفي لساني نورا"
  },
  {
    "value": "اللهم أنت ربى لا إله إلا أنت خلقتنى وانا عبدك وأنا على عهدك ووعدك ما استطعتأعوذ بك من شر ما صنعت أبوء لك بنعمتك على وأبوء بذنبى فاغفر لى فإنه لايغفر الذنوب إلا أنت\n"
  }
]