Repository: m7mdra/quran
Catalog: lib/l10n/app_*.arb
Languages: ar

# splashLoadingTitle
source: Loading quran data...
ar: يتم الأن تحميل الصفحات

# applicationSponsor
source: Application Sponsor : Wado Tech
ar: التطبيق برعاية : ودو تك

source: Last reading
ar: اخر قراءة

source: Tap to view
ar: اضغظ للذهاب للسورة

source: Suar Alquran
ar: سور القران

source: Reader
ar: القارئ

source: Interpretation
ar: تفسير

source: Save
ar: حفظ

source: Play
ar: تشغيل

# saveBookmarkDialogTitle
source: Save bookmark
ar: حفظ علامة قراءة

# saveBookmarkDialogMessage
source: Write the name of the Bookmark so that you can refer to it later
ar: قم بكتابة اسم علامة القراءة حتى يمكن الرجوع اليها لاحقا

# saveBookmarkDialogFieldHint
source: Example: Surat Al-Baqarah verse 10
ar: مثال: سورة البقرة الاية ١٠

source: Cancel
ar: الغاء

# searchReader
source: Search reader by name
ar: ابحث عن قارئ بالاسم

# searchReaderNotFound
source: No readers were found with the search key
ar: لم يتم ايجاد قارئين بمفتاح البحث

source: Failed to load data.
ar: فشل تحميل البيانات

# error
source: There was an error.
ar: حصل خطا, قم بالمحاولة مرة اخرى

# bookmarkSaveError
source: Failed to save bookmark
ar: فشل حفظ علامة القراءة

# bookmarkSaveSuccess
source: Bookmark save successfully.
ar: تم حفظ علامة القراءة بنجاح.

source: Contents
ar: الفهرس

source: times
ar: مرة

source: Praise
ar: تسبيح

# resetCounter
source: Reset the counter
ar: تصفير العداد

# resetCounterDialogTitle
source: Do you want to go back to zero?
ar: هل انت واثق من تصفير العداد؟

source: Attention
ar: تنبيه

# noBookmarks
source: No bookmarks saved.
ar: لا توجد ملاحظات حتى الان

source: Add Note
ar: اضافة ملاحظة

# noteTitleHint
source: Title
ar: العنوان

# noteTitleEmptyError
source: Title field is empty
ar: حقل العنوان خالي

# noteDescriptionHint
source: Content
ar: المتحوى

# noteDescriptionEmptyError
source: Content field is empty
ar: حقل المحتوى خالي

# noNoteSaved
source: No notes saved
ar: لم يتم اضافة ملاحظات بعد

# noNoteSavedContent
source: Add a note by clicking the circular button with the plus sign at the bottom
ar: قم باضافة ملاحظة بالضغط على الزر الدائري بعلامة الزائد في الاسفل

# permissionDeniedTitle
source: Geolocation access has been denied
ar: لقد تم رفض صلاحية الوصول للموقع

# permissionDeniedMessage
source: Press the button below to grant permission and display Qibla direction
ar: اضغط على الزر بالاسفل لمنح الصلاحية وعرض اتجاه القبلة

source: Grant access
ar: منح الصلاحية

source: Retry
ar: اعادة المحاولة

# downloadFailed
source: Failed to download file, try again
ar: فشل تحميل الملف, حاول مجددا

# downloadingFile
source: Downloading book...
ar: جاري تحميل الكتاب

# downloadNotFound
source: This file is not available on the device, the device will download it from the Internet so that it is always available
ar: هذا الملف غير متوفر في الجهاز, سوف يقوم الجهاز بتحميله من الانترنت ليكون متوفر دائما

source: Download
ar: تحميل

# searchPlaceHolder
source: Search for Ayah
ar: ابحث عن ايات

# searchFailed
source: Failed to find verses matching the search word
ar: فشل ايجاد ايات مطابقة لكلمة البحث

# searchEmpty
source: No verses were found matching the search word
ar: لم يتم ايجاد ايات مطابقة لكلمة البحث

# processingData
source: The operational data is now being processed
ar: يتم الان معالجة البيانات التشغيلية

# processingDataLongTime
source: This process may take a long time ...
ar: قد تاخد هذه العملية زمنا طويلاً...

# processingDataSuccess
source: The data has been downloaded and processed successfully
ar: تم تحميل ومعالجة البيانات بنجاح

# processingDataSuccessMessage
source: You can now start using the application with all the available features
ar: يمكنك الان ان تبدا باستخدام التطبيق بكل خواصه المتاحة

# processingDataSuccessButton
source: OK, start using the app
ar: حسنا , ابدا استخدام التطبيق

# failedToProcessData
source: Failed to process data data
ar: فشل معالجة البيانات البيانات

# failedToProcessDataMessage
source: An error has occurred while trying to process data
ar: لقد حصل خطا اثناء محاولة معالجة البيانات

# downloadingData
source: The operational data is now uploaded
ar: يتم الان تحميل البيانات التشغيلية

# welcomeToQuran
source: Welcome to the Quran application
ar: مرحبا بكم في تطبيق القران

# welcomeToQuranMessage
source: Apparently, this is the first time for you to use the application. The application will download 70 MB data via your internet. This data is very important to use all the features of the application and the application cannot work without it.
ar: على ما يبدو هذه المرة الاولى لك باستخدام التطبيق سوف يقوم التطبيق بتحميل بيانات حجمها ٧٠ ميجا عبر الانترنت الخاص بك هذه البيانات مهمة جدا لاستخدام جميع خواص التطبيق ولا يمكن للتطبيق العمل بدونها

# startDownloadButton
source: Ok, start downloading
ar: حسنا , ابدا التحميل
